1) Use map to double each element in a list of numbers.
Use filter to select only the odd numbers from a list of integers.

In [410]:
import random
nums = random.sample(range(1, 100), 20)
nums

[15, 37, 81, 26, 54, 27, 3, 55, 67, 97, 82, 16, 29, 38, 2, 49, 60, 10, 24, 45]

In [411]:
def double(x):
    return 2 * x

result = map(double, nums)
doubled_numbers = list(result)
print(doubled_numbers)

[30, 74, 162, 52, 108, 54, 6, 110, 134, 194, 164, 32, 58, 76, 4, 98, 120, 20, 48, 90]

In [412]:
odd_numbers = list(filter(lambda num: num % 2 != 0, nums))
print(odd_numbers)

[15, 37, 81, 27, 3, 55, 67, 97, 29, 49, 45]

2) Read a CSV file into a pandas DataFrame and display the first few rows.
Group a DataFrame by a specific column and calculate the average of another column.
Merge two DataFrames based on a common column.

In [413]:
import pandas as pd
# from https://catalog.data.gov/dataset/real-estate-sales-2001-2018
real_estate_data = pd.read_csv('Real_Estate_Sales_2001-2020_GL.csv')

C:\Users\dovil\AppData\Local\Temp\ipykernel_1152\2624610627.py:2: DtypeWarning: Columns (8,9,10,11,12) have mixed types. Specify dtype option on import or set low_memory=False.
  real_estate_data = pd.read_csv(r'C:\Users\dovil\Desktop\she goes tech\data\Real_Estate_Sales_2001-2020_GL.csv')

In [414]:
real_estate_data.shape

(997213, 14)

In [415]:
real_estate_data_2020 = real_estate_data[real_estate_data['List Year']==2020]

In [416]:
real_estate_data_2020.shape

(66592, 14)

In [417]:
real_estate_data_2020.head(8)

,Serial Number,List Year,Date Recorded,Town,Address,Assessed Value,Sale Amount,Sales Ratio,Property Type,Residential Type,Non Use Code,Assessor Remarks,OPM remarks,Location
0,2020177,2020,04/14/2021,Ansonia,323 BEAVER ST,"133,000.00","248,400.00",0.54,Residential,Single Family,NaN,NaN,NaN,POINT (-73.06822 41.35014)
1,2020225,2020,05/26/2021,Ansonia,152 JACKSON ST,"110,500.00","239,900.00",0.46,Residential,Three Family,NaN,NaN,NaN,NaN
2,2020348,2020,09/13/2021,Ansonia,230 WAKELEE AVE,"150,500.00","325,000.00",0.46,Commercial,NaN,NaN,NaN,NaN,NaN
3,2020090,2020,12/14/2020,Ansonia,57 PLATT ST,"127,400.00","202,500.00",0.63,Residential,Two Family,NaN,NaN,NaN,NaN
4,200500,2020,09/07/2021,Avon,245 NEW ROAD,"217,640.00","400,000.00",0.54,Residential,Single Family,NaN,NaN,NaN,NaN
5,200121,2020,12/15/2020,Avon,63 NORTHGATE,"528,490.00","775,000.00",0.68,Residential,Single Family,NaN,NaN,NaN,POINT (-72.89675 41.79445)
6,20058,2020,06/01/2021,Barkhamsted,46 RATLUM MTN RD,"203,530.00","415,000.00",0.49,Residential,Single Family,NaN,"2003 COLONIAL, 2140 SFLA, 2.99 AC",NaN,NaN
7,200046,2020,01/25/2021,Beacon Falls,34 LASKY ROAD,"158,030.00","243,000.00",0.65,Residential,Single Family,NaN,NaN,NaN,NaN

In [418]:
pd.options.display.float_format = '{:,.2f}'.format
real_estate_data_2020_by_town = real_estate_data_2020.groupby(['Town'])['Sale Amount'].mean().sort_values(ascending=False)
real_estate_data_2020_by_town

Town
Willington   53,237,242.17
Greenwich     2,378,571.81
Darien        1,762,818.08
New Canaan    1,669,782.96
Stamford      1,623,796.04
                  ...
Waterbury       200,935.55
Union           195,166.67
Torrington      183,257.85
Bridgeport      178,855.54
Deep River      150,000.00
Name: Sale Amount, Length: 144, dtype: float64

In [419]:
# from https://ephtracking.cdc.gov/DataExplorer/
# Air Quality Index (AQI) for fine particle pollution (PM2.5)
air_quality_data = pd.read_csv('data_062155.csv', encoding= 'unicode_escape')

In [420]:
air_quality_data.shape

(478632, 11)

In [421]:
air_quality_data.head()

,StateFIPS,State,CountyFIPS,Location,Year,Date,Value,Data Comment,AQI Category,Concentration (µg/m³),Data Source
0,1,Alabama,1001,Autauga,2023,03/04/2023,1,NaN,Good (1),9.40,EPA AirNow Contours [research-grade]
1,1,Alabama,1001,Autauga,2023,05/04/2023,1,NaN,Good (1),10.30,EPA AirNow Contours [research-grade]
2,1,Alabama,1001,Autauga,2023,10/04/2023,1,NaN,Good (1),8.40,EPA AirNow Contours [research-grade]
3,1,Alabama,1001,Autauga,2023,12/04/2023,2,NaN,Moderate (2),19.20,EPA AirNow Contours [research-grade]
4,1,Alabama,1001,Autauga,2023,03/05/2023,1,NaN,Good (1),7.70,EPA AirNow Contours [research-grade]

In [422]:
air_quality_data.rename(columns = {'Location':'Town'}, inplace = True)

In [423]:
air_quality_data_by_town = air_quality_data.groupby(['Town'])['Concentration (µg/m³)'].mean().sort_values(ascending=False)

In [424]:
merged = pd.merge(real_estate_data_2020_by_town, air_quality_data_by_town, how="outer", on=["Town"])
merged.shape

(1910, 2)

In [425]:
outer_merged2 = merged[merged['Concentration (µg/m³)']>0][merged['Sale Amount']>0]
outer_merged2

C:\Users\dovil\AppData\Local\Temp\ipykernel_1152\1161668436.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  outer_merged2 = merged[merged['Concentration (µg/m³)']>0][merged['Sale Amount']>0]

            Sale Amount  Concentration (µg/m³)
Town
Washington 1,045,480.27                   9.22
Weston     1,032,207.51                   6.61
Sherman      663,741.93                   5.99
Warren       654,445.19                  10.10
Madison      601,576.44                   9.61
Orange       596,334.42                   9.19
Trumbull     584,926.84                  11.46
Essex        559,715.85                   9.27
Kent         510,438.43                  10.36
Guilford     506,992.21                  10.08
Tolland      490,341.42                  10.12
Windsor      462,121.28                   6.97
Goshen       455,953.35                   6.74
Cheshire     451,301.04                   7.76
Monroe       435,232.62                  10.41
Litchfield   431,562.98                  10.31
Woodbury     431,512.78                   8.38
New Haven    404,437.98                  11.24
Morris       395,702.61                  12.56
Chester      393,038.51                  10.96
Norfolk      366,974.57                   9.60
Burlington   357,898.68                  12.80
Hartford     352,472.65                  10.51
Columbia     341,578.45                   9.50
New London   322,369.09                   9.81
Windham      295,863.41                   8.73
Salem        277,600.03                  11.58
Putnam       275,482.12                   9.79
Bristol      268,358.57                   8.64
Franklin     256,087.41                   9.29
Hampton      251,911.30                  10.21
Lebanon      250,755.13                  15.12
Winchester   249,219.81                  10.38
Scotland     246,118.92                   9.97
Vernon       236,129.32                  10.03
Preston      225,374.94                  10.17
Sterling     207,145.62                  10.63
Plymouth     201,975.71                   8.85
Union        195,166.67                  10.05

3) Define a Person named tuple with fields for name, age, and city. Create instances of Person and access their attributes.

In [426]:
from collections import namedtuple

In [427]:
Person = namedtuple('Person', ['name','age','city'])

In [428]:
Person = Person('Une','11','Riga')

In [429]:
Person.name, Person.age, Person.city

('Une', '11', 'Riga')

4) Count the frequency of each word in a given text and display the top 5 most common words.
Merge two counters together and calculate the total count of each element.

In [430]:
from collections import Counter

In [431]:
text1 = 'Lithuania  is a country in the Baltic region of Europe.[a] It is one of three Baltic states and lies on the eastern shore of the Baltic Sea. Lithuania shares land borders with Latvia to the north, Belarus to the east and south, Poland to the south, and Russia to the southwest.[b] It has a maritime border with Sweden to the west on the Baltic Sea. Lithuania covers an area of 65,300 km2 (25,200 sq mi), with a population of 2.8 million. Its capital and largest city is Vilnius; other major cities are Kaunas, Klaipėda, Šiauliai and Panevėžys. Lithuanians belong to the ethno-linguistic group of the Balts and speak Lithuanian, one of only a few living Baltic languages.'

In [432]:
text1_splited = text1.split()
count1 = Counter(text1_splited)
count1

Counter({'Lithuania': 3,
         'is': 3,
         'a': 4,
         'country': 1,
         'in': 1,
         'the': 11,
         'Baltic': 5,
         'region': 1,
         'of': 7,
         'Europe.[a]': 1,
         'It': 2,
         'one': 2,
         'three': 1,
         'states': 1,
         'and': 6,
         'lies': 1,
         'on': 2,
         'eastern': 1,
         'shore': 1,
         'Sea.': 2,
         'shares': 1,
         'land': 1,
         'borders': 1,
         'with': 3,
         'Latvia': 1,
         'to': 6,
         'north,': 1,
         'Belarus': 1,
         'east': 1,
         'south,': 2,
         'Poland': 1,
         'Russia': 1,
         'southwest.[b]': 1,
         'has': 1,
         'maritime': 1,
         'border': 1,
         'Sweden': 1,
         'west': 1,
         'covers': 1,
         'an': 1,
         'area': 1,
         '65,300': 1,
         'km2': 1,
         '(25,200': 1,
         'sq': 1,
         'mi),': 1,
         'population': 1,
         '2.8': 1,
         'million.': 1,
         'Its': 1,
         'capital': 1,
         'largest': 1,
         'city': 1,
         'Vilnius;': 1,
         'other': 1,
         'major': 1,
         'cities': 1,
         'are': 1,
         'Kaunas,': 1,
         'Klaipėda,': 1,
         'Šiauliai': 1,
         'Panevėžys.': 1,
         'Lithuanians': 1,
         'belong': 1,
         'ethno-linguistic': 1,
         'group': 1,
         'Balts': 1,
         'speak': 1,
         'Lithuanian,': 1,
         'only': 1,
         'few': 1,
         'living': 1,
         'languages.': 1})

In [433]:
count1.most_common(5)

[('the', 11), ('of', 7), ('and', 6), ('to', 6), ('Baltic', 5)]

In [434]:
text2 = 'Lithuania is a developed country, with a high income advanced economy; ranking very high 35th in the Human Development Index. Lithuania is a member of the European Union, the Council of Europe, eurozone, the Nordic Investment Bank, Schengen Agreement, NATO and OECD. It also participates in the Nordic-Baltic Eight (NB8) regional co-operation format.'

In [435]:
text2_splited = text2.split()

In [436]:
count1.update(text2_splited)
count1

Counter({'Lithuania': 5,
         'is': 5,
         'a': 7,
         'country': 1,
         'in': 3,
         'the': 16,
         'Baltic': 5,
         'region': 1,
         'of': 9,
         'Europe.[a]': 1,
         'It': 3,
         'one': 2,
         'three': 1,
         'states': 1,
         'and': 7,
         'lies': 1,
         'on': 2,
         'eastern': 1,
         'shore': 1,
         'Sea.': 2,
         'shares': 1,
         'land': 1,
         'borders': 1,
         'with': 4,
         'Latvia': 1,
         'to': 6,
         'north,': 1,
         'Belarus': 1,
         'east': 1,
         'south,': 2,
         'Poland': 1,
         'Russia': 1,
         'southwest.[b]': 1,
         'has': 1,
         'maritime': 1,
         'border': 1,
         'Sweden': 1,
         'west': 1,
         'covers': 1,
         'an': 1,
         'area': 1,
         '65,300': 1,
         'km2': 1,
         '(25,200': 1,
         'sq': 1,
         'mi),': 1,
         'population': 1,
         '2.8': 1,
         'million.': 1,
         'Its': 1,
         'capital': 1,
         'largest': 1,
         'city': 1,
         'Vilnius;': 1,
         'other': 1,
         'major': 1,
         'cities': 1,
         'are': 1,
         'Kaunas,': 1,
         'Klaipėda,': 1,
         'Šiauliai': 1,
         'Panevėžys.': 1,
         'Lithuanians': 1,
         'belong': 1,
         'ethno-linguistic': 1,
         'group': 1,
         'Balts': 1,
         'speak': 1,
         'Lithuanian,': 1,
         'only': 1,
         'few': 1,
         'living': 1,
         'languages.': 1,
         'developed': 1,
         'country,': 1,
         'high': 2,
         'income': 1,
         'advanced': 1,
         'economy;': 1,
         'ranking': 1,
         'very': 1,
         '35th': 1,
         'Human': 1,
         'Development': 1,
         'Index.': 1,
         'member': 1,
         'European': 1,
         'Union,': 1,
         'Council': 1,
         'Europe,': 1,
         'eurozone,': 1,
         'Nordic': 1,
         'Investment': 1,
         'Bank,': 1,
         'Schengen': 1,
         'Agreement,': 1,
         'NATO': 1,
         'OECD.': 1,
         'also': 1,
         'participates': 1,
         'Nordic-Baltic': 1,
         'Eight': 1,
         '(NB8)': 1,
         'regional': 1,
         'co-operation': 1,
         'format.': 1})

5) Use a deque to implement a queue and perform enqueue and dequeue operations.
Reverse the order of elements in a deque.

In [437]:
from collections import deque

In [438]:
d = deque()

In [439]:
d = deque([1, 2, 3, 4, 5, 6, 7, 8, 9, 10])

In [440]:
d

deque([1, 2, 3, 4, 5, 6, 7, 8, 9, 10])

In [441]:
d.extend([11, 12, 13])
d

deque([1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13])

In [442]:
print(d.pop())

13

In [443]:
d

deque([1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12])

In [444]:
d.reverse()
print(d)

deque([12, 11, 10, 9, 8, 7, 6, 5, 4, 3, 2, 1])

6) Create a defaultdict that maps a character to a list of words starting with that character.
Calculate the sum of values for each key in a dictionary using a defaultdict.

In [445]:
from collections import defaultdict

In [446]:
mammals = 'Cats Jaguars Dogs Panthers Horses Tigers Kangaroos Leopards Elephants Lions Dolphins Whales Monkeys Pumas Humans'
mammals_list = mammals.split()

mammals_dict = defaultdict(list)

for mammal in mammals_list:
    mammals_dict[mammal[0]].append(mammal)

for key in sorted(mammals_dict.keys() ):
    print(key, mammals_dict[key])

C ['Cats']
D ['Dogs', 'Dolphins']
E ['Elephants']
H ['Horses', 'Humans']
J ['Jaguars']
K ['Kangaroos']
L ['Leopards', 'Lions']
M ['Monkeys']
P ['Panthers', 'Pumas']
T ['Tigers']
W ['Whales']

In [447]:
mammals_dict = defaultdict(int)

for mammal in mammals_list:
    mammals_dict[mammal[0]] += 1

for key in sorted(mammals_dict.keys()):
    print(key, mammals_dict[key])

C 1
D 2
E 1
H 2
J 1
K 1
L 2
M 1
P 2
T 1
W 1

7) Use reduce to find the maximum element in a list of numbers.
Combine a list of strings into a single string using reduce.

In [448]:
from functools import reduce

In [449]:
max = reduce(lambda x, y: x if x > y else y, nums)
print(max)

97

In [450]:
text = 'Vilnius is the capital and the largest city of Lithuania'
text_splited = text.split()
text_splited

['Vilnius',
 'is',
 'the',
 'capital',
 'and',
 'the',
 'largest',
 'city',
 'of',
 'Lithuania']

In [451]:
sentence = reduce(lambda x, y: x + ' ' + y, text_splited)
print(sentence)

Vilnius is the capital and the largest city of Lithuania